Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་དེ་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པའི་སྒོ་དེ་དག་ལ་སྩོགས་པ་གང་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་རྣམ་པར་ཕྱེ་བའི་ཚུལ་མངོན་པར་བསྒྲུབ་པའི་ལས་ཚད་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་གཞལ་དུ་མེད་པ་དེ་དག་ཉེ་བར་བསྒྲུབ་པ་མཛད་དོ།
en: “O jinaputras! This is how the buddha bhagavats summarize the immeasurable, incalculable entrances to the accomplishment of wisdom, and so on, to the bodhisattva who has reached that bhūmi. Through those entrances to the accomplishment of wisdom the bodhisattva who has these aspects of infinite wisdom obtains the activity of accomplishment. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །ཁྱེད་ཀྱིས་ཡིད་ཆེས་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་ན་གལ་ཏེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་མངོན་པར་བསྒྲུབ་པའི་སྒོར་གཞུག་པ་མཛད་དུ་ཟིན་ན། དེ་ཉིད་དེའི་མཐའ་ལས་བརྒལ་བའི་མྱ་ངན་ལས་འདས་པར་འགྱུར་ཏེ།
en: I say to you, I declare to you, that if the buddha bhagavats did not bring the bodhisattva into the entrance to the accomplishment of omniscient wisdom, he would enter nirvāṇa, and his activity for all beings would cease.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགོས་པ་འང་རྒྱུན་གཅད་པར་འགྱུར་རོ། །དེ་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ནི།
en: Therefore, the buddha bhagavats provide the bodhisattva with countless activities for the accomplishment of wisdom. This activity that accomplishes wisdom brings accomplishment in each instant.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པའི་ལས་གང་གིས་སྐད་ཅིག་གཅིག་ཏུ་མངོན་པར་བསྒྲུབ་པས་ཀྱང་ཐོག་མ་སེམས་བསྐྱེད་པ་ཕྱིན་ཅད་ས་བདུན་པ་ལ་ཞུགས་ཤིང་། རྗེས་སུ་སོང་བ་ཡོངས་སུ་རྩོམ་པའི་བར་སྔ་མ་དེ་དག་གིས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ། སྟོང་གི་ཆ་དང་ཁྲག་ཁྲིག་གི་ཆ་དང་། ཁྲག་ཁྲིག་བརྒྱའི་ཆ་དང་། ཁྲག་ཁྲིག་སྟོང་གི་ཆ་དང་། ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: All the previous activities followed and undertaken from the very first development of motivation up through the seventh bhūmi are not even a hundredth of this activity that accomplishes limitless wisdom, not even a thousandth, a hundred thousandth, a ten millionth, a billionth, a ten billionth, a trillionth, or even a quintillionth of it.

source: །གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་། རྒྱུར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་བསྒྲུན་བཙམ་གྱི་བར་དུ་འང་མི་ཆོག་པ་དེ་སྙེད་དུ་ཚད་མེད་པའི་ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པ་ལས་ཉེ་བར་བསྒྲུབ་པ་མཛད་དོ།
en: They cannot be correlated to it through numbers, enumeration, comparison, resemblance, or similitude.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why is that? O jinaputras!

source: སྔོན་ཅད་ལུས་གཅིག་གིས་མངོན་པར་བསྒྲུབས་པས་སྤྱོད་པ་མངོན་པར་བསྒྲུབ་པར་གྱུར་གྱི་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ལུས་རྣམ་པར་ཕྱེ་བ་ཚད་མེད་པས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་མཐུ་ཡོངས་སུ་སྡུད་དེ།
en: Previously activities were accomplished through accomplishment in one body.

source: དབྱངས་མངོན་པར་བསྒྲུབ་པ་ཚད་མེད་པ་དང་། ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པ་ཚད་མེད་པ་དང་། སྐྱེ་བ་མངོན་པར་བསྒྲུབ་པ་ཚད་མེད་པ་དང་། ཞིང་ཡོངས་སུ་སྦྱང་བ་ཚད་མེད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ཚད་མེད་པ་དང་། སངས་རྒྱས་མཆོད་ཅིང་བསྙེན་བཀུར་བ་ཚད་མེད་པ་དང་། ཆོས་ཀྱི་ཚུལ་ཁོང་དུ་ཆུད་པ་ཚད་མེད་པ་དང་། མངོན་པར་ཤེས་པ་མངོན་པར་བསྒྲུབ་པའི་སྟོབས་དང་ཤུགས་ཚད་མེད་པ་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་ཚད་མེད་པ་རྣམ་པར་ཕྱེ་བ་དང་། ཚད་མེད་པའི་རྗེས་སུ་སོང་བའི་ལུས་དང་། ངག་དང་ཡིད་ཀྱི་ལས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཀྱི་མཐུ་མི་སྒུལ་བའི་ཚུལ་གྱིས་ཡང་དག་པར་སྒྲུབ་བོ།
en: However, the bodhisattva who has reached this bhūmi attains the accomplishment of countless separate bodies, countless voices, countless wisdoms, countless births, countless creations of realms, countless activities of ripening beings, countless activities of offering to and serving buddhas, countless realizations of the way of the Dharma, countless powers of clairvoyance, and countless circles of followers, and through possessing countless accomplishments of the body, he attains the power of all bodhisattva conduct through being steadfastly united with it. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱ་མཚོ་ཆེན་པོར་འགྲོ་བའི་གྲུ་ནི་རྒྱ་མཚོ་ཆེན་པོར་མ་ཕྱིན་གྱི་བར་དུ་ཆེད་དུ་བསྐྱོད་ཅིང་འགྲོ་བར་བྱ་བ་ཡིན་ཏེ།
en: To give an analogy, it is like a ship that crosses the ocean.

source: རྒྱ་མཚོ་ཆེན་པོ་ལ་ཞེན་མ་ཐག་ཏུ་རླུང་གི་དཀྱིལ་འཁོར་གྱིས་བསྩུ་བས་ཆེད་དུ་བསྐྱོད་མི་དགོས་པ་ཡིན།
en: Before it enters the ocean, it has to be moved with effort. Once it has completely entered the ocean, it moves effortlessly, propelled by the wind.

source: དེས་རྒྱ་མཚོ་ཆེན་པོ་ལ་ཉིན་གཅིག་གིས་ཅི་ཆོད་པ་དེ་ནི་སྔོན་ཆེད་དུ་བསྐྱོད་ཅིང་འགྲོ་བས་ལོ་བརྒྱར་ཡང་དེ་ལྟར་ཚད་མེད་པར་ཕྱིན་པར་མི་ནུས་སོ།
en: In one day on the ocean it travels immeasurably further than it could be carried on land in a hundred years. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་བའི་རྩ་བ་ཆེན་པོའི་ཚོགས་ཡང་དག་པར་བསྩགས་པ། ཐེག་པ་ཆེན་པོའི་གྲུར་ཞུགས་པ་ཡང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྒྱ་མཚོར་ཕྱིན་ནས། ཡུད་ཙམ་ཅིག་ཏུ་ལྷུན་གྱིས་གྲུབ་པའི་ཡེ་ཤེས་ཀྱིས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཇི་ཙམ་ཡང་དག་པར་གནོན་པ་དེ་ནི་སྔོན་གྱི་ཆེད་དུ་བྱ་བའི་ལས་ཀྱིས་བསྐལ་པ་བརྒྱ་སྟོང་དུ་ཡང་ཡང་དག་པར་གནོན་པར་མི་ནུས་སོ།
en: In that same way, the bodhisattva who has perfectly accumulated a great accumulation of roots of goodness sails in the ship of the Mahāyāna on the ocean of bodhisattva activity, and with effortless wisdom he reaches the wisdom of omniscience in a moment, whereas his previous activities with effort would immeasurably fail to achieve that, even in a hundred thousand eons.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ས་བརྒྱད་པ་འདི་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐབས་མཁས་པའི་ཡེ་ཤེས་ཀྱིས་བསྒྲུབ་པ་ལྷུན་གྱིས་གྲུབ་པ་ལ་ཤིན་ཏུ་ཞུགས་པའི།
en: “O jinaputras! The bodhisattva who has reached the eighth bodhisattva bhūmi investigates omniscient wisdom through the bodhisattva realization that arises from the accomplishment of skillful methods and wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་བློས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་རྣམ་པར་དཔྱོད་ཅིང་འཇིག་རྟེན་གྱི་ཁམས་འབྱུང་བ་ཡང་རྣམ་པར་དཔྱོད་དོ།
en: He also investigates the origin of a universe.

source: །འཇིག་རྟེན་གྱི་ཁམས་འཇིག་པ་འང་རྣམ་པར་དཔྱོད་དོ།
en: He also investigates the destruction of a universe.

source: །དེ་འཇིག་རྟེན་ཇི་ལྟར་འབྱུང་བ་དེ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows perfectly the origin of a universe.

source: །འཇིག་རྟེན་ཇི་ལྟར་འཇིག་པ་དེ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows perfectly how a universe is destroyed.

source: །ལས་གང་བསྩགས་པས་འཇིག་རྟེན་འབྱུང་བར་འགྱུར་བ་དེ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows perfectly the accumulation of karma that causes the creation of a universe.

source: །ལས་གང་བསྩགས་པས་འཇིག་རྟེན་ན་འཇིག་པར་འགྱུར་བ་དེ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows perfectly the exhaustion of karma that causes a universe to be destroyed.

source: །དུས་ཇི་སྲིད་ཀྱིས་འཇིག་རྟེན་འབྱུང་བར་འགྱུར་བ་དེ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows when a universe will be created.

source: །དུས་ཇི་སྲིད་ཀྱིས་འཇིག་རྟེན་འཇིག་པར་འགྱུར་བ་དེ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows when a universe will be destroyed.

source: །དུས་ཇི་སྲིད་དུ་འཇིག་རྟེན་བྱུང་ནས་གནས་པ་དེ་འང་རབ་ཏུ་ཤེས་སོ།
en: He knows for how long a universe will remain after it has been created.

source: །དུས་ཇི་སྲིད་དུ་འཇིག་རྟེན་ཞིག་པར་གནས་པ་དེ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows for how long the universe will remain destroyed.

source: །དེ་སའི་ཁམས་ཤིན་ཏུ་ཆུང་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: Everywhere, without exception, he knows the smallest elements of earth;

source: །སའི་ཁམས་ཤིན་ཏུ་ཆེ་བ་འང་རབ་ཏུ་ཤེས་སོ།
en: he knows the greatest elements of earth;

source: །སའི་ཁམས་ཚད་མེད་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: he knows immeasurable elements of earth;

source: །སའི་ཁམས་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: and he knows the different kinds of elements of earth.

source: །དེ་ཆུའི་ཁམས་ཤིན་ཏུ་ཆུང་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows the smallest elements of water;

source: །ཆུའི་ཁམས་ཤིན་ཏུ་ཆེ་བའང་རབ་ཏུ་ཤེས་སོ།
en: he knows the greatest elements of water;

source: །ཆུའི་ཁམས་ཚད་མེད་པ་འང་རབ་ཏུ་ཤེས་སོ།
en: he knows immeasurable elements of water;

source: །ཆུའི་ཁམས་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: and he knows the different kinds of elements of water.

source: །དེ་མྱེའི་ཁམས་ཤིན་ཏུ་ཆུང་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows the smallest elements of fire;

source: །མྱེའི་ཁམས་ཤིན་ཏུ་ཆེ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: he knows the greatest elements of fire;

source: །མྱེའི་ཁམས་ཚད་མེད་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: he knows immeasurable elements of fire;

source: །མྱེའི་ཁམས་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: and he knows the different kinds of elements of fire.

source: །དེ་རླུང་གི་ཁམས་ཤིན་ཏུ་ཆུང་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows the smallest elements of air;

source: །རླུང་གི་ཁམས་ཤིན་ཏུ་ཆེ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: he knows the greatest elements of air;

source: །རླུང་གི་ཁམས་ཚད་མྱེད་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: he knows immeasurable elements of air;

source: །རླུང་གི་ཁམས་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: and he knows the different kinds of elements of air.

source: །དེ་ཤིན་ཏུ་ཕྲ་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: He knows the smallest atoms;

source: །ཤིན་ཏུ་ཕྲ་བའི་རྡུལ་ཡངས་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: he knows the greatest atoms;

source: །ཤིན་ཏུ་ཕྲ་བའི་རྡུལ་ཚད་མེད་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: he knows immeasurable atoms;

source: །ཤིན་ཏུ་ཕྲ་བའི་རྡུལ་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: and he knows the different kinds of atoms.

source: །འཇིག་རྟེན་གྱི་ཁམས་གང་ན་སའི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: He knows how many atoms of earth there are in the universe.

source: །ཆུའི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: He knows how many atoms of water there are in the universe.

source: །མྱེའི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: He knows how many atoms of fire there are in the universe.

source: །རླུང་གི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: He knows how many atoms of air there are in the universe.

source: །རིན་པོ་ཆེ་རྣམ་པར་ཕྱེ་བ་ཇི་སྙེད་ཡོད་པ་དང་། རིན་པོ་ཆེའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: He knows the different kinds of precious materials. He knows how many atoms there are in precious materials.

source: །སེམས་ཅན་གྱི་ལུས་ལ་རྡུལ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: He knows how many atoms there are in the bodies of beings.

source: །ཞིང་གི་ལྷུན་ལ་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: He knows how many atoms there are in the realms.

source: །དེ་སེམས་ཅན་གྱི་ལུས་ཆེ་བ་དང་། ལུས་ཡངས་པ་དང་། ལུས་ཕྲ་བ་དང་། ལུས་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows the corporeal bodies of beings; he knows the subtle bodies of beings; and he knows the different kinds of bodies of beings.

source: །སེམས་ཅན་དམྱལ་བ་པའི་ལུས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཀྱིས་བྱུང་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་པའི་ལུས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཀྱིས་བྱུང་བ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པའི་ལུས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཀྱིས་བྱུང་བ་དང་། ལྷ་མ་ཡིན་གྱི་འཇིག་རྟེན་པའི་ལུས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཀྱིས་བྱུང་བ་དང་། ལྷའི་འཇིག་རྟེན་པའི་ལུས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཀྱིས་བྱུང་བ་དང་། མྱིའི་རིས་སུ་གཏོགས་པའི་ལུས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཀྱིས་བྱུང་བ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: He knows how many atoms there are in the bodies of beings in the hells. He knows how many atoms there are in the bodies of animals. He knows how many atoms there are in the bodies of those in the realm of Yama. He knows how many atoms there are in the bodies of beings in the realm of the asuras. He knows how many atoms there are in the bodies of beings in the realms of devas. He knows how many atoms there are in the bodies of beings in the realm of humans.

source: །དེ་དེ་ལྟར་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རབ་ཏུ་དབྱེ་བ་ལ་ཞུགས་པ་ནི་འདོད་པའི་ཁམས་འཇིག་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །གཟུགས་ཀྱི་ཁམས་འཇིག་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །གཟུགས་མྱེད་པའི་ཁམས་འཇིག་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He who has thus gained the knowledge of the different kinds of atoms knows the creation of the form realm, and he knows the creation of the formless realm.

source: །འདོད་པའི་ཁམས་འདུ་བ་ཡང་རབ་ཏུ་ཤེས་སོ། །གཟུགས་ཀྱི་ཁམས་འདུ་བ་ཡང་རབ་ཏུ་ཤེས་སོ། །གཟུགས་མེད་པའི་ཁམས་འདུ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: “He knows the destruction of the desire realm, knows the destruction of the form realm, and knows the destruction of the formless realm.

source: །འདོད་པའི་ཁམས་ཆུང་བ་ཡང་རབ་ཏུ་ཤེས་སོ། །འདོད་པའི་ཁམས་ཆེ་བ་འང་རབ་ཏུ་ཤེས་སོ། །འདོད་པའི་ཁམས་ཚད་མྱེད་པ་འང་རབ་ཏུ་ཤེས་སོ། །འདོད་པའི་ཁམས་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: “He knows the smallest desire realms, knows the greatest desire realms, knows the immeasurable desire realms, and knows the different kinds of desire realms.

source: །གཟུགས་ཀྱི་ཁམས་དང་གཟུགས་མྱེད་པའི་ཁམས་ཆུང་བ་ཡང་རབ་ཏུ་ཤེས་སོ། །ཆེ་བ་འང་རབ་ཏུ་ཤེས་སོ། །ཚད་མྱེད་པ་འང་རབ་ཏུ་ཤེས་སོ། །རྣམ་པར་ཕྱེ་བ་འང་རབ་ཏུ་ཤེས་སོ།
en: “He knows the smallest form and formless realms, knows the greatest form and formless realms, knows the immeasurable form and formless realms, and knows the different kinds of form and formless realms.

source: །དེ་ཁམས་གསུམ་རྣམ་པར་དཔྱད་པའི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པ་མངོན་པར་བསྒྲུབ་པའི་ཡེ་ཤེས་ཀྱི་སྣང་བ་དང་ལྡན་ལ།
en: “He has the illumination of the wisdom of accomplishment in attaining the wisdom that analyzes the three realms.

source: སེམས་ཅན་གྱི་ལུས་རབ་ཏུ་དབྱེ་བ་ལ་མཁས་ཤིང་། ཞིང་གི་ལྷུན་རྣམ་པར་དབྱེ་བའི་ཡེ་ཤེས་ལ་མཁས་པས་སྐྱེ་བའི་སྐྱེ་མཆེད་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པ་ལ་བློ་ཤིན་ཏུ་གཏོང་སྟེ།
en: He has the skillful wisdom of the different kinds of bodies of beings, the skillful wisdom of the different forms of worlds, so that his realization is focused on the process of birth of all beings.

source: དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་ཕྱིར་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་བ་དང་། ཡོངས་སུ་གྲུབ་པ་ཅི་འདྲ་བ་དེ་ལྟ་བུར་རང་གི་ལུས་བྱིན་གྱིས་རློབ་བོ།
en: In order to ripen all beings, he takes possession of a body that is the same as the birth and creation of beings.

source: །དེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱས་པར་བཀང་ཞིང་སེམས་ཅན་གྱི་མོས་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རང་གི་ལུས་མིག་ཡོར་ལྟ་བུའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བས་སྐྱེ་བར་བྱ་བའི་ཕྱིར་མངོན་པར་བསྒྲུབ་སྟེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གཉིས་སམ། གསུམ་མམ། བཞི་འམ། ལྔ་འམ། བཅུ་འམ།
en: He pervades one billion-world universe, and in accordance with his knowledge of illusory manifestation he takes birth in a body that accords with the various aspirations of beings.

source: ཉི་ཤུ་འམ། སུམ་ཅུ་འམ། བཞི་བཅུ་འམ། ལྔ་བཅུ་དག་ནས་བརྗོད་དུ་མྱེད་པའི་ཡང་བརྗོད་དུ་མྱེད་པའི་བར་དག་རྒྱས་པར་བཀང་སྟེ། སེམས་ཅན་གྱི་མོས་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རང་གི་ལུས་མྱིག་ཡོར་ལྟ་བུའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བས་སྐྱེ་བར་བྱ་བའི་ཕྱིར་མངོན་པར་སྒྲུབ་བོ།
en: In that way he pervades two billion-world universes, and three, four, five, ten, twenty, thirty, forty, fifty, and uncountable billion-world universes, taking birth in a body that accords with the aspirations of beings.

source: །དེ་དེ་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་པས་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ནས་ཀྱང་མྱི་གཡོ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པ་དག་གི་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དག་དུ་ཡང་སྣང་བར་ཕྱིན་པ་ཡིན།
en: With the possession of that wisdom, while never leaving one buddha realm, he manifests in the circle of followers of tathāgatas in countless buddha realms.

source: དེ་སེམས་ཅན་རྣམས་ཀྱི་ལུས་རྣམ་པར་ཕྱེ་བ་དང་། མོས་པ་དང་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཞིང་དེ་དང་དེ་དག་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་དང་། དེ་དག་ཏུ་དེ་ལྟ་དེ་ལྟར་རང་གི་ལུས་སྟོན་ཏེ།
en: “In those buddha realms and in those circles of followers he manifests bodies that accord with the different kinds of bodies of beings, their aspirations, and their motivations.

source: དགེ་སྦྱོང་གི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་དགེ་སྦྱོང་གི་ཁ་དོག་དང་གཟུགས་སྟོན་ཏོ།
en: He manifests the color and form of a śramaṇa within the circle of śramaṇa followers.

source: །བྲམ་ཟེའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ། བྲམ་ཟེའི་ཁ་དོག་དང་གཟུགས་སྟོན་ཏོ།
en: He manifests the color and form of a brahmin within the circle of brahmin followers.

source: །རྒྱལ་རིགས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་རྒྱལ་རིགས་ཀྱི་ཁ་དོག་དང་གཟུགས་སྟོན་ཏོ།
en: He manifests the color and form of a kṣatriya within the circle of kṣatriya followers.

source: །རྗེའུ་རིགས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ། རྗེའུ་རིགས་ཀྱི་ཁ་དོག་དང་གཟུགས་སྟོན་ཏོ།
en: He manifests the color and form of a vaiśya within the circle of vaiśya followers.

source: །ཁྱིམ་བདག་གི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ། ཁྱིམ་བདག་གི་ཁ་དོག་དང་གཟུགས་སྟོན་ཏོ།
en: He manifests the color and form of a śūdra within the circle of śūdra followers. He manifests the color and form of a householder within the circle of householder followers.

source: །རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ། རྒྱལ་པོ་ཆེན་པོ་བཞིའི་ཁ་དོག་དང་གཟུགས་སྟོན་ཏོ།
en: He manifests the color and form of a Catur­mahā­rājika deva within the circle of Catur­mahā­rājika deva followers.

source: །སུམ་ཅུ་རྩ་གསུམ་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ། སུམ་ཅུ་རྩ་གསུམ་པའི་ཁ་དོག་དང་གཟུགས་སྟོན་ཏོ།
en: He manifests the color and form of a Trāya­striṃśa deva within the circle of Trāya­striṃśa deva followers.

source: །དེ་བཞིན་དུ་མཚེ་མའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དང་། དགའ་ལྡན་གྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དང་། འཕྲུལ་དགའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དང་། ཚངས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ནས་འོག་མིན་གྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་བར་ཏུ་དེ་ལྟ་དེ་ལྟ་བུའི་ཁ་དོག་དང་གཟུགས་སྟོན་ཏོ།
en: And it is the same way within the circle of Yāma deva followers, the circle of Tuṣita deva followers, the circle of Nirmāṇarati deva followers, the circle of Para­nirmita­vaśa­vartin deva followers, the circle of Māra deva followers, the circle of Brahmā deva followers, and so on, up to the circle of Akaniṣṭha deva followers.

source: །དེ་ཉན་ཐོས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཉན་ཐོས་ཀྱི་ལུས་དང་ཁ་དོག་དང་གཟུགས་སྟོན་ཏོ།
en: “He appears in the color and form of a śrāvaka to those beings who are to be guided by śrāvakas.

source: །རང་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་རང་སངས་རྒྱས་ཀྱི་ལུས་དང་ཁ་དོག་དང་གཟུགས་སྟོན་ཏོ།
en: He appears in the color and form of a pratyekabuddha to those beings who are to be guided by pratyekabuddhas.

source: །བྱང་ཆུབ་སེམས་དཔས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་ཁ་དོག་དང་གཟུགས་སྟོན་ཏོ།
en: He appears in the color and form of a bodhisattva to those beings who are to be guided by bodhisattvas.

source: །དེ་བཞིན་གཤེགས་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་དང་ཁ་དོག་དང་གཟུགས་སྟོན་ཏོ།
en: He appears in the color and form of a tathāgata to those beings who are to be guided by tathāgatas.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་ཇི་སྙེད་པ་དེ་དག་གི་སེམས་ཅན་རྣམས་ཀྱི་མོས་པ་རབ་ཏུ་མང་བ་དེ་དག་ཐམས་ཅད་དུ་རང་གི་ལུས་དེ་ལྟ་དེ་ལྟར་རྣམ་པར་ཕྱེ་བ་ཡོངས་སུ་སྟོན་ཏོ།
en: “Thus he manifests specific bodies in accordance with the aspirations of the myriads of beings in countless buddha realms. “O jinaputras!

source: །དེ་ལུས་ཀྱི་རྣམ་པར་རྟོག་པ་དང་། འདུ་ཤེས་ཐམས་ཅད་དང་རྣམ་པར་བྲལ་བ་སྟེ། ལུས་མཉམ་པ་ཉིད་ཐོབ་པས། སེམས་ཅན་གྱི་ལུས་རབ་ཏུ་ཤེས་སོ།
en: He is free of all the concepts of body, has attained the equality of bodies, and knows the bodies of beings.

source: །ཞིང་གི་ལུས་དང་རྣམ་པར་སྨིན་པའི་ལུས་དང་། ཉན་ཐོས་ཀྱི་ལུས་དང་། རང་སངས་རྒྱས་ཀྱི་ལུས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་དང་། ཡེ་ཤེས་ཀྱི་ལུས་དང་། ཆོས་ཀྱི་ལུས་དང་། ནམ་མཁའི་ལུས་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: He knows the bodies of realms, the bodies of ripened karma, the bodies of śrāvakas, the bodies of pratyekabuddhas, the bodies of bodhisattvas, the bodies of tathāgatas, the bodies of consciousness, the bodies of phenomena, and the bodies of space.

source: །དེས་སེམས་ཅན་རྣམས་ཀྱི་སེམས་དང་བསམ་པ་མངོན་པར་བསྒྲུབ་པ་ཡོངས་སུ་ཤེས་པས།
en: “He knows the minds of beings and the accomplishment of their wishes.

source: འདོད་ན་སེམས་ཅན་གྱི་ལུས་ནམ་མཁའི་ལུས་སུ་བྱིན་གྱིས་རློབ་བོ། །དེ་བཞིན་དུ་ཞིང་གི་ལུས་དང་། ལས་རྣམ་པར་སྨིན་པའི་ལུས་དང་། ཉན་ཐོས་ཀྱི་ལུས་དང་། རང་སངས་རྒྱས་ཀྱི་ལུས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་དང་། ཡེ་ཤེས་ཀྱི་ལུས་དང་། ཆོས་ཀྱི་ལུས་ཀྱང་ནམ་མཁའི་ལུས་སུ་བྱིན་གྱིས་རློབ་བོ།
en: Therefore, if he wishes to, he can manifest the body of a being as his own body. Similarly he can manifest the body of a realm, a body of ripened karma, the body of a śrāvaka, the body of a pratyekabuddha, the body of a bodhisattva, the body of a tathāgata, a body of consciousness, a body of phenomena, and a body of space as his own body.

source: །དེས་སེམས་ཅན་རྣམས་ཀྱི་སེམས་དང་བསམ་པ་མངོན་པར་བསྒྲུབ་པ་ཡོངས་སུ་ཤེས་པས་སེམས་ཅན་གྱི་ལུས་རང་གི་ལུས་སུ་བྱིན་གྱིས་རློབ་བོ།
en: “He knows the accomplishment of the motivation and aspirations of beings, and therefore, if he wishes to, he can manifest his own body as a body of beings.

source: །དེ་བཞིན་དུ་ཞིང་གི་ལུས་དང་ལས་རྣམ་པར་སྨིན་པའི་ལུས་དང་། ཉན་ཐོས་ཀྱི་ལུས་དང་། རང་སངས་རྒྱས་ཀྱི་ལུས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་དང་། ཡེ་ཤེས་ཀྱི་ལུས་དང་ཆོས་ཀྱི་ལུས་དང་ནམ་མཁའི་ལུས་ཀྱང་རང་གི་ལུས་སུ་བྱིན་གྱིས་རློབ་བོ། །དེས་སེམས་ཅན་རྣམས་ཀྱི་སེམས་དང་བསམ་པ་མངོན་པར་བསྒྲུབ་པ་ཡོངས་སུ་ཤེས་པས། ལུས་གང་དང་གང་།
en: Similarly he can manifest his body as the body of a realm, a body of ripened karma, the body of a śrāvaka, the body of a pratyekabuddha, the body of a bodhisattva, the body of a tathāgata, a body of wisdom, a body of the Dharma, and a body of space.

source: ལུས་གང་དང་གང་དུ་འདོད་པ་དེ་དང་དེའི་ལུས་སུ་ལུས་དེ་དང་དེ་དག་བྱིན་གྱིས་རློབ་བོ།
en: “He can manifest any body to be whatever body he wishes.

source: །དེས་སེམས་ཅན་ཀྱི་ལུས་རྣམས་ཀྱི་ལས་ཀྱི་ལུས་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: “He also knows the bodies of beings that are bodies of karma.

source: །རྣམ་པར་སྨིན་པའི་ལུས་དང་། ཉོན་མོངས་པའི་ལུས་དང་། གཟུགས་ཀྱི་ལུས་དང་། གཟུགས་མེད་པའི་ལུས་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: He knows the bodies that are ripened, the bodies of kleśas, the bodies of form, and the bodies that are formless.

source: །ཞིང་གི་ལུས་རྣམས་ཀྱི་ཆུང་བའི་རང་བཞིན་ཡང་རབ་ཏུ་ཤེས་སོ། །ཆེ་བ་དང་ཚད་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་དག་པ་དང་། སྣྲེལ་ཞི་དང་། སྤྱིའུ་ཚུགས་དང་། གཞི་མཉམ་པར་ཡང་དག་པར་འཇུག་པ་དང་། ཕྱོགས་ཀྱི་དྲ་བ་རྣམ་པར་དབྱེ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: “He also knows the smallest extent of the bodies in realms. He knows their greater extensiveness, their immeasurability, their defilement, their purity, their disorder, their inversion, their levelness, their groupings, and their classification within the network of directions.

source: །ལས་རྣམ་པར་སྨིན་པའི་ལུས་རྣམ་པར་ཕྱེ་བའི་བརྡ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: “He knows also the signs of the category of bodies from ripened karma.

source: །དེ་བཞིན་དུ་ཉན་ཐོས་ཀྱི་ལུས་རྣམ་པར་ཕྱེ་བའི་བརྡ་དང་། རང་སངས་རྒྱས་ཀྱི་ལུས་རྣམ་པར་ཕྱེ་བའི་བརྡ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལུས་རྣམ་པར་ཕྱེ་བའི་བརྡ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: He knows the signs of the category of the bodies of śrāvakas, the signs of the category of the bodies of pratyekabuddhas, and the signs of the category of the bodies of bodhisattvas.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་རྣམས་ཀྱི་མངོན་པར་འཚང་རྒྱ་བའི་ལུས་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: He knows the signs of the category of the bodies of tathāgatas and the bodies of enlightenment.

source: །སྨོན་ལམ་གྱི་ལུས་དང་སྤྲུལ་པའི་ལུས་དང་། བྱིན་གྱི་རླབས་ཀྱི་ལུས་དང་། གཟུགས་དང་མཚན་དང་དཔེ་བྱད་བཟང་པོའི་རྒྱན་གྱི་ལུས་དང་། འོད་ཀྱི་ལུས་དང་ཡིད་ཀྱི་རང་བཞིན་གྱི་ལུས་དང་། བསོད་ནམས་ཀྱི་ལུས་དང་། ཡེ་ཤེས་ཀྱི་ལུས་དང་། ཆོས་ཀྱི་ལུས་ཀྱང་རབ་ཏུ་ཤེས་སོ། །ཡེ་ཤེས་ཀྱི་ལུས་རྣམས་ཀྱི་ཤིན་ཏུ་རྣམ་པར་དཔྱད་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་བརྟགས་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: “He knows the signs of the categories of the bodies of prayer, the bodies of emanation, the bodies of manifestation, the bodies adorned by the primary and secondary signs of a great being, the bodies of light, the bodies composed of mind, the bodies of merit, the bodies of consciousness, and the bodies of phenomena.

source: །འབྲས་བུའི་སྦྱོར་བས་ཡང་དག་པར་བཟུང་བ་དང་། འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པ་རྣམ་པར་ཕྱེ་བ་དང་། ཐེག་པ་གསུམ་རྣམ་པར་དགོད་པ་དང་། ཐུན་མོང་དང་ཐུན་མོང་མ་ཡིན་པ་དང་། འབྱུང་བ་དང་མི་འབྱུང་བ་དང་། སློབ་པ་དང་། མི་སློབ་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: “He knows the classification of the bodies of consciousness: those of true accomplishment, those that are combined with results, their classification into mundane and transcendent, their establishment within the three yānas, the general and the specific, those conducive to liberation and those not conducive to liberation, and those training and those passed beyond training.

source: །ཆོས་ཀྱི་ལུས་རྣམས་ཀྱི་མཉམ་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: “He knows the equality of the bodies of phenomena.
